<!-- dflook/terraform-github-actions {"workspace":"remote-workspace-validate-2","backend":"52d4e2ef6219950369cb58dddabe1b4e0bc4f7145eb86a99f619ee116f945f37","backend_type":"remote"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __remote-workspace-validate-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables="from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + default        = "default"
  + from_tfvars    = "from_tfvars"
  + from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #12](https://github.com/dflook/terraform-github-actions/actions/runs/2258863679)